In [44]:
import pandas as pd
import numpy as np

In [45]:
Data = {'S':['a','a','b','b','c', 'k','a','b','a'], 'B':['b','b','a','a','b','a','i','u','b'],
       'V':[10,7,23,54,34,5,90,8,5], 'D':[1,2,3,4,5,6,7,8,9]}
df = pd.DataFrame(Data)
df

   S  B   V  D
0  a  b  10  1
1  a  b   7  2
2  b  a  23  3
3  b  a  54  4
4  c  b  34  5
5  k  a   5  6
6  a  i  90  7
7  b  u   8  8
8  a  b   5  9

In [46]:
df1 = df.rename(columns={'S': 'B', 'B': 'S', 'V':'V1','D':'D1'}) 
df1

   B  S  V1  D1
0  a  b  10   1
1  a  b   7   2
2  b  a  23   3
3  b  a  54   4
4  c  b  34   5
5  k  a   5   6
6  a  i  90   7
7  b  u   8   8
8  a  b   5   9

In [47]:
df_thinned = pd.merge(df.drop_duplicates(), df1, on=['S', 'B'], how='inner')
df_thinned

    S  B   V  D  V1  D1
0   a  b  10  1  23   3
1   a  b  10  1  54   4
2   a  b   7  2  23   3
3   a  b   7  2  54   4
4   a  b   5  9  23   3
5   a  b   5  9  54   4
6   b  a  23  3  10   1
7   b  a  23  3   7   2
8   b  a  23  3   5   9
9   b  a  54  4  10   1
10  b  a  54  4   7   2
11  b  a  54  4   5   9

In [48]:
df_thinned['diff'] = df_thinned['D1'] - df_thinned['D']
df_thinned1 = df_thinned[df_thinned['diff'] > 0]
df_thinned1

    S  B   V  D  V1  D1  diff
0   a  b  10  1  23   3     2
1   a  b  10  1  54   4     3
2   a  b   7  2  23   3     1
3   a  b   7  2  54   4     2
8   b  a  23  3   5   9     6
11  b  a  54  4   5   9     5

In [49]:
sorted_df = df_thinned1.sort_values(by=['D1'], ascending=True)
sorted_df

    S  B   V  D  V1  D1  diff
0   a  b  10  1  23   3     2
2   a  b   7  2  23   3     1
1   a  b  10  1  54   4     3
3   a  b   7  2  54   4     2
8   b  a  23  3   5   9     6
11  b  a  54  4   5   9     5

In [50]:
s = np.unique(df_thinned1['S'])
b = np.unique(df_thinned1['B'])

In [52]:
df[df['S'].isin(s) & df['B'].isin(b)]

   S  B   V  D
0  a  b  10  1
1  a  b   7  2
2  b  a  23  3
3  b  a  54  4
8  a  b   5  9